package com.nd.smartcan.appfactory.generate;
 
import java.util.ArrayList;
import java.util.LinkedHashMap;
import java.util.Map;
import java.util.Stack;
import com.nd.smartcan.appfactory.businessInterface.IJsonMapCreator;
 
/***********************************
Notice: This Class is generated at compile time
************************************/
public class G_th_components_permission_config_data implements IJsonMapCreator
{
	@Override
	public /*modify-src*/ Map<String, Object> createMap() 
	{
		if (cacheMap != null) {
			return cacheMap;
		}
		cacheMap = _createMap();
		return cacheMap;
	}
	
	private static Map<String, Object> cacheMap;

	public Map<String, Object> _createMap()
	{
		Stack<Object> stack = new Stack();
		Map<String, Object> map1 = new LinkedHashMap<String, Object>(16);
		ArrayList<Object> list1 = null;
		stack.push(map1);
		{
			map1 = (Map<String, Object>) stack.peek();
			map1.put("InformationSecurity", "เราจะใช้มาตรการป้องกันความปลอดภัยที่สอดคล้องกับมาตรฐานอุตสาหกรรมและสมเหตุสมผลเพื่อปกป้องข้อมูลส่วนบุคคลที่คุณให้มา ป้องกันไม่ให้ข้อมูลส่วนบุคคลถูกเข้าถึง เปิดเผย ใช้งาน แก้ไข เสียหาย หรือสูญหายโดยไม่ได้รับอนุญาต เรามีระบบการจัดการความปลอดภัยของข้อมูลที่ทันสมัยในอุตสาหกรรม โดยมุ่งเน้นที่ข้อมูลเป็นหลักและครอบคลุมวงจรชีวิตของข้อมูล เพิ่มความปลอดภัยของระบบทั้งหมดในหลายมิติจากการสร้างองค์กร การออกแบบนโยบาย การจัดการบุคลากร และเทคโนโลยีผลิตภัณฑ์ คุณสามารถตรวจสอบนโยบายความเป็นส่วนตัวของผลิตภัณฑ์หรือบริการที่เกี่ยวข้องสำหรับมาตรการทางเทคนิคด้านความปลอดภัยของข้อมูลส่วนบุคคลของคุณ");
			map1.put("PermissionSettingExplain", "หากต้องการเปิดหรือปิดการให้สิทธิ์ โปรดทำตามขั้นตอนต่อไปนี้:\\n1. เปิดการตั้งค่าโทรศัพท์\\n2. ค้นหาแอปพลิเคชันในรายการแอป\\n3. คลิกเพื่อเข้าไปดูหรือแก้ไขการตั้งค่าสิทธิ์");
			map1.put("STORAGE_intro", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการอัปโหลดหรือดาวน์โหลดรูปภาพ วิดีโอ และไฟล์ได้");
			map1.put("LOCATION_intro", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการเกี่ยวกับตำแหน่งที่ตั้ง เช่น การระบุตำแหน่งโรงเรียนและการแชร์ตำแหน่งแบบเรียลไทม์กับเพื่อนได้");
			map1.put("CAMERA_intro", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการสแกน QR โค้ด ถ่ายภาพหรือวิดีโอในแอปพลิเคชันโรงเรียนประถมและมัธยมศึกษาอัจฉริยะ (สำหรับการเปลี่ยนรูปโปรไฟล์/ข้อเสนอแนะ/การสอนผ่านมือถือ ฯลฯ) ได้");
			map1.put("MICROPHONE_intro", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการสนทนาด้วยเสียง จัดกิจกรรมการเรียนรู้ กิจกรรมการฝึกอบรม บันทึกเสียง และวิดีโอสั้นได้");
			map1.put("PHONE_intro", "ให้บริการการแจ้งเตือนข้อมูลและการควบคุมความเสี่ยงด้านความปลอดภัยแก่คุณ");
			map1.put("LOCATION_BACKGROUND_intro", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการเกี่ยวกับตำแหน่งที่ตั้ง เช่น การระบุตำแหน่งโรงเรียนและการแชร์ตำแหน่งแบบเรียลไทม์กับเพื่อนได้");
			map1.put("BOOT_intro", "ให้บริการการเริ่มต้นอัตโนมัติหลังจากเปิดระบบแก่คุณ");
			map1.put("STORAGE_detail", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการอัปโหลดหรือดาวน์โหลดรูปภาพ วิดีโอ และไฟล์ได้");
			map1.put("LOCATION_detail", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการเกี่ยวกับตำแหน่งที่ตั้ง เช่น การระบุตำแหน่งโรงเรียนและการแชร์ตำแหน่งแบบเรียลไทม์กับเพื่อนได้");
			map1.put("CAMERA_detail", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการสแกน QR โค้ด ถ่ายภาพหรือวิดีโอในแอปพลิเคชันโรงเรียนประถมและมัธยมศึกษาอัจฉริยะ (สำหรับการเปลี่ยนรูปโปรไฟล์/ข้อเสนอแนะ/การสอนผ่านมือถือ ฯลฯ) ได้");
			map1.put("MICROPHONE_detail", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการสนทนาด้วยเสียง จัดกิจกรรมการเรียนรู้ กิจกรรมการฝึกอบรม บันทึกเสียง และวิดีโอสั้นได้");
			map1.put("PHONE_detail", "ให้บริการการแจ้งเตือนข้อมูลและการควบคุมความเสี่ยงด้านความปลอดภัยแก่คุณ");
			map1.put("LOCATION_BACKGROUND_detail", "เมื่ออนุญาตแล้ว คุณสามารถดำเนินการเกี่ยวกับตำแหน่งที่ตั้ง เช่น การระบุตำแหน่งโรงเรียนและการแชร์ตำแหน่งแบบเรียลไทม์กับเพื่อนได้");
			map1.put("BOOT_detail", "ให้บริการการเริ่มต้นอัตโนมัติหลังจากเปิดระบบแก่คุณ");
		}
		return map1;
	}
}
